/*******************************************************************************
* タイトル:		バトルプログラム
* プログラム名:	Battle.cpp
* 作成者:		GP11A132 17 鍾政殷
* 作成日:		2023/06/19
*******************************************************************************/



/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "Battle.h"


/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/


/*******************************************************************************
* グローバル変数
*******************************************************************************/
BATTLE battle;
int ground[g_HEIGHT][g_WIDTH] =
{
	0, 0, 0, 0, 0, 0,
	0, 2, 0, 3, 3, 3,
	1, 0, 0, 3, 3, 3,
	0, 2, 0, 3, 3, 3,
	0, 0, 0, 0, 0, 0,
};


/*******************************************************************************
 関数名:
 引数　:
 戻り値:
 説明　:
*******************************************************************************/

// バトルの初期化処理
void InitBattle(void) {
	battle.turn = 0;
	battle.p = GetPlayer();
	battle.e = GetEnemy();
	battle.s = GetPet();
	// プレイヤーの初期化

	battle.p->HP = 30;
	battle.p->str = 1;
	battle.s->HP = 0;
	battle.s->str = 25;
		
	battle.e->HP = 100;
	battle.e->str = 15;
	strcpy(battle.e->name, "中級デーモン\0");
}

// バトルの終了処理
void UninitBattle(void) {

}
//　バトルの更新処理
void UpdateBattle(void)
{
	if(battle.p->HP > 0 && battle.e->HP > 0)
	{
		battle.e->HP--;
	}
}

// バトル表示処理

void DrawBattle(void)
{
	printf("\n\n");
	for(int y = 0; y < g_HEIGHT; y++)
	{
		printf("                   ");
		for(int x = 0; x < g_WIDTH; x++)
		{
			switch (ground[y][x]) {
				case 0: 
					printf(" ");
					break;
				case 1: // プレイヤー
					printf("P");
					break;
				case 2: // プレイヤーの召喚物
					printf("S");
					break;
				case 3: // 敵
					printf("D");
					break;
			}
		}
		printf("\n");
	}
	printf("\n");
	printf("%s HP: %d \t\t %s HP: %d\n", battle.p->name, battle.p->HP, battle.e->name, battle.e->HP);
	if (battle.s->HP > 0)	printf("%s の召喚獣HP: %d\n", battle.p->name, battle.s->HP);
	else printf("\n");
	Sleep(200);
	system("cls");
}



