/*******************************************************************************
* タイトル:		エネミープログラム
* プログラム名:	Enemy.cpp
* 作成者:		GP11A132 17 鍾政殷
* 作成日:		2023/06/19
*******************************************************************************/



/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "Enemy.h"
#include "Player.h"
#include "Field.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/


/*******************************************************************************
* グローバル変数
*******************************************************************************/
ENEMY enemy[ENEMY_MAX];

/*******************************************************************************
 関数名:	
 引数　:	
 戻り値:	
 説明　:	
*******************************************************************************/
// エネミーの初期化
void InitEnemy(void) {
	enemy[0].x = 8;
	enemy[0].y = 8;
}
// エネミーの終了処理
void UninitEnemy(void) {

}
// エネミーの更新処理
void UpdateEnemy(void) {
	// 現在の座標を保存しておく エネミー.ver


	PLAYER* player = getPlayer();

	enemy[0].ox = enemy[0].x;
	enemy[0].oy = enemy[0].y;

	

	
	for (int i = 0; i < ENEMY_MAX; i++){
		int rng = rand() % 8;
		switch(rng)
		{
		case 0:
			enemy[i].x--;
			break;
		case 1:
			enemy[i].x++;
			break;
		case 2:
			enemy[i].y--;
			break;
		case 3:
			enemy[i].y++;
			break;
		default:
			break;
		}
		
	}
	
	// 移動後の場所をチェックする　エネミー.ver
	for (int i = 0; i < ENEMY_MAX; i++) {
		switch (getFieldData( (enemy + i)->y, (enemy + i)->x)) {
		case 0:
			break;
		case 1:
			enemy[i].y = enemy[i].oy;
			enemy[i].x = enemy[i].ox;
			break;
		default:
			printf("$");
			break;
		}
	}
}
// エネミーの描画処理
void DrawEnemy(void) {
	printf("M");
}

ENEMY* getEnemy(void) {
	return enemy;
}







