/*******************************************************************************
* タイトル:		プレイヤープログラム
* プログラム名:	Player.cpp
* 作成者:		GP11A132 17 鍾政殷
* 作成日:		2023/06/19
*******************************************************************************/



/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "Player.h"
#include "Field.h"

/*******************************************************************************
* マクロ定義
*******************************************************************************/


/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/

/*******************************************************************************
* グローバル変数
*******************************************************************************/
PLAYER player[PLAYER_MAX];

/*******************************************************************************
 関数名:	
 引数　:	
 戻り値:	
 説明　:	
*******************************************************************************/

// プレイヤーの初期化
void InitPlayer(void) {
	player[0].x = 5;
	player[0].y = 5;
}
// プレイヤーの終了処理
void UninitPlayer(void) {

}
// プレイヤーの更新処理
void UpdatePlayer(void) {

	if (_kbhit() == 0) {
		system("cls");
		return;
	}

	// 現在の座標を保存しておく
	int opx = player[0].x;
	int opy = player[0].y;

	// キー入力を取得する
	rewind(stdin);
	int key = _getch();
	if (key == 0 || key == 0xe0) {
		key = _getch(); // 戻り値：ASCIIコード
	}
	system("cls");

	// printf("key: %d\n\n", key);

	// キーボードから読み込み 0xとは16進数 \0とは8進数
	switch (key) {
	case 'w':
	case 0x48:
		player[0].y--;
		break;
	case 'a':
	case 0x4b:
		player[0].x--;
		break;
	case 's':
	case 0x50:
		player[0].y++;
		break;
	case 'd':
	case 0x4d:
		player[0].x++;
		break;
	}

	// 移動後の場所をチェックする
	switch (getFieldData(player->y, player->x)) {
	case 0:
		break;
	case 1:
		player[0].y = opy;
		player[0].x = opx;
		break;
	default:
		printf("$");
		break;
	}
}
// プレイヤーの描画処理
void DrawPlayer(void) {
	printf("P");
}

PLAYER* getPlayer(void) {
	return player;
}



